[[null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null], [null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null], [null, null, { "entity": "player", "info": {"name": 1, "direction": "S"}}, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null], [null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null], [null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null], [null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null], [null, null, null, null, null, null, null, null, null, null, null, null, null, null, { "entity": "player", "info": {"name": 2, "direction": "S"}}, null, null, null, null], [null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null], [null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null], [null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null], [null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null],
["water", "Another common variable in programming is called a <i>boolean</i>, which can have either the value “true” or “false”.  We can use this to evaluate different conditions; for example, if you want to know if the number<code> x=1</code> is equal to the number 2, the expression <code>x==2</code> would return the boolean value “false”.  However, the statement <code>x<3</code> would return “true”.  This is extremely valuable when you only want to call a method only if a certain condition is satisfied, and do something else if it’s not.  Consider the following example: <code>name=Mark age=21 if name==Mark and age==21: print “My name is Mark; I’m 21 years old” elif name!=Mark and age==21: print “My name isn’t Mark; I’m 21 years old.” else: print “My name isn’t Mark and I’m not 21 years old.”</code>  We only call certain methods if the conditions specified in the <i>if statement</i> before them are satisfied.  Try this on your own- you will pick up an unknown item from a box using the method <code>get_in_front().take_item()</code>.  If the item is an axe, say “I got something sharp”.  If it’s a wand, say “I got something magical”, and if it’s a tomato, “I got something red”."]]
