[[null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null], [null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null], [null, null, { "entity": "player", "info": {"name": 1, "direction": "S"}}, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null], [null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null], [null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null], [null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null], [null, null, null, null, null, null, null, null, null, null, null, null, null, null, { "entity": "player", "info": {"name": 2, "direction": "S"}}, null, null, null, null], [null, null, null, null, null, null, null, null, { "entity": "slime" }, null, null, null, null, null, null, null, null, null, null], [null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null], [null, null, null, null, null, null, null, null, null, null, null, null, { "entity": "slime" }, null, null, null, null, null, null], [null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null],
["water", "It would be really cumbersome to keep typing out the values of variables you have already stored when you use them later in your code.  So, there are several shortcuts to avoid typing the same thing over and over again in Python.  If you want to print out a string that you’ve already saved under the name myname within a unique message, you can write code similar to the following: <code>self.say(“My name is: %s” %myname)</code>.  Similarly, you can use the shortcut <code>%d </code>for a number, and there are several others.  Solve a riddle and print the answer using this convention by getting answers from creatures: It is 2013. The day before yesterday I was 32 years old, but next year I will be 35 ! When is my birthday? What's the date of today (date at which this sentence was true)?"]]
