[[null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null], [null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null], [null, null, { "entity": "player", "info": {"name": 1, "direction": "S"}}, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null], [null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null], [null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null], [null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null], [null, null, null, null, null, null, null, null, null, null, null, null, null, null, { "entity": "player", "info": {"name": 2, "direction": "S"}}, null, null, null, null], [null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null], [null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null], [null, null, null, { "entity": "sign" }, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null], [null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null],
["water", "Now, what if you have a list and you want to use the variables in this list to create a new list?  This may sound strange, but imagine you have a sentence, and you’re asked to find how many characters are in the words in this list.  This is where something called <i>list comprehension</i> comes in handy.  Python allows you to take the words in the list containing this sentence, and create a new list which contains only the numbers representing the lengths of these words.  From here, it is easy to find how many total characters are contained in the given sentence, ignoring ‘the’.  Here is the Python code to accomplish this:  <code>sentence = \"Facebook is the best\" words = sentence.split() word_lengths = [len(word) for word in words if word != \"the\"]</code>.  Do the same thing on your own- read a sign, and decipher the code by printing out the first letter of each word except ‘the’.  (To find the first letter of a word, named number 0 by convention, you need to call <code>word[0]</code>.)"]]
